Working_examples/POD_RBF_cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    upAndDown
    {
        type            patch;
        nFaces          200;
        startFace       77377;
    }
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       77577;
    }
    outlet
    {
        type            patch;
        nFaces          98;
        startFace       77627;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          56;
        startFace       77725;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          38465;
        startFace       77781;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          38465;
        startFace       116246;
    }
)

// ************************************************************************* //
