Working_examples/POD_RBF_cylinder/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
38465
(
(1.000052284 -5.322038957e-05 0)
(1.000038183 -0.0001453555466 0)
(1.000032204 -0.0002170702957 0)
(1.000030486 -0.0002809662021 0)
(1.000028632 -0.0003412441842 0)
(1.000026342 -0.0003973217454 0)
(1.000024301 -0.0004490037685 -1.323520792e-23)
(1.000022131 -0.0004964083798 1.323517895e-23)
...
)
;

boundaryField
{
    upAndDown
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
