Working_examples/POD_RBF_cylinder/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -1 0 0 0 0];



internalField uniform 0.000009349782;

boundaryField
{
     inlet
     {
           type fixedValue;
           value $internalField;

               }
      upAndDown
      {
           type zeroGradient;
       }
      front
       {
           type empty;
       }
      back
       {
           type empty;
       }

      outlet
      {
           type            calculated;
        value           $internalField;       
      }
      cylinder     
 {
            type nutkWallFunction;
            value uniform 0;
       }
     
}


// ************************************************************************* //
