Working_examples/POD_RBF_cylinder/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 -1 0 0 0 0];

internalField uniform 1.6307298;

        boundaryField
        {
        cylinder 
        {
             type fixedValue;
             value uniform 1.6307298;
        }
         front
       {
           type empty;
       }
       back
       {
           type empty;
       }

       inlet {	type fixedValue;
      		value $internalField;      }
        outlet
         {
             type            inletOutlet;
             inletValue      $internalField;
             value           $internalField;

         }
           upAndDown
       {
           type zeroGradient;
       }
}


// ************************************************************************* //
